intro-to-julia/01-Getting_started.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-08 Sat 18:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Getting started with Julia</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Juliabox team" />
<meta name="description" content="Julia Language tutorials and testing"
 />
<meta name="keywords" content="julia, data science, emacs, ESS, org-mode, development" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Getting started with Julia</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#getting-started">1. Getting started</a>
<ul>
<li><a href="#how-to-print">1.1. How to print</a></li>
<li><a href="#how-to-assign-variables">1.2. How to assign variables</a></li>
<li><a href="#how-to-comment">1.3. How to comment</a></li>
<li><a href="#syntax-for-basic-math">1.4. Syntax for basic math</a></li>
<li><a href="#exercises">1.5. Exercises</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="ABSTRACT">
<p>
How to run some cells in org mode.
</p>

<p>
<b>Sat Sep  8 17:34:37 CDT 2018</b>.
</p>

</div>

<div id="outline-container-org88edf67" class="outline-2">
<h2 id="getting-started"><a id="org88edf67"></a><span class="section-number-2">1</span> Getting started</h2>
<div class="outline-text-2" id="text-getting-started">
<p>
<b>Topics</b>:
</p>

<ol class="org-ol">
<li>How to print</li>
<li>How to assign variables</li>
<li>How to comment</li>
<li>Syntax for basic math</li>
</ol>
</div>

<div id="outline-container-orgca61564" class="outline-3">
<h3 id="how-to-print"><a id="orgca61564"></a><span class="section-number-3">1.1</span> How to print</h3>
<div class="outline-text-3" id="text-how-to-print">
<p>
In Julia we usually use <code>println()</code> to print
</p>

<div class="org-src-container">
<pre class="src src-julia">println(<span style="color: #718da5;">"I'm excited to learn Julia!"</span>)
</pre>
</div>

<pre class="example">
I'm excited to learn Julia!

</pre>
</div>
</div>

<div id="outline-container-org146e8d0" class="outline-3">
<h3 id="how-to-assign-variables"><a id="org146e8d0"></a><span class="section-number-3">1.2</span> How to assign variables</h3>
<div class="outline-text-3" id="text-how-to-assign-variables">
<p>
All we need is a variable name, value, and an equal's sign! Julia will
figure out types for us.
</p>

<div class="org-src-container">
<pre class="src src-julia">my_answer = 42
typeof(my_answer)
</pre>
</div>

<pre class="example">
42
Int64

</pre>

<div class="org-src-container">
<pre class="src src-julia">my_pi = 3.14159
typeof(my_pi)
</pre>
</div>

<pre class="example">
3.14159
Float64

</pre>

<div class="org-src-container">
<pre class="src src-julia">&#128570; = <span style="color: #718da5;">"smiley cat!"</span>
typeof(&#128570;)
</pre>
</div>

<pre class="example">
"smiley cat!"
String

</pre>

<p>
To type a smiley cat, use tab completion to select the emoji name and
then tab again
</p>

<pre class="example">
# \:smi + &lt;tab&gt; --&gt; select with down arrow + &lt;enter&gt; ---&gt; &lt;tab&gt; + &lt;enter&gt; to complete
</pre>

<p>
After assigning a value to a variable, we can reassign a value of a
different type to that variable without any issue.
</p>

<div class="org-src-container">
<pre class="src src-julia">  &#128570; = 1
</pre>
</div>

<pre class="example">
1

</pre>

<div class="org-src-container">
<pre class="src src-julia">typeof(&#128570;)
</pre>
</div>

<pre class="example">
Int64

</pre>

<p>
Note: Julia allows us to write super generic code, and 😺 is an example
of this.
</p>

<p>
This allows us to write code like
</p>

<div class="org-src-container">
<pre class="src src-julia">  &#128512; = 0
  &#128542; = -1
</pre>
</div>

<pre class="example">
0
-1

</pre>

<div class="org-src-container">
<pre class="src src-julia">  &#128570; + &#128542; == &#128512;
</pre>
</div>

<pre class="example">
true

</pre>
</div>
</div>

<div id="outline-container-org6f6cab8" class="outline-3">
<h3 id="how-to-comment"><a id="org6f6cab8"></a><span class="section-number-3">1.3</span> How to comment</h3>
<div class="outline-text-3" id="text-how-to-comment">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #5c616c;"># </span><span style="color: #5c616c;">You can leave comments on a single line using the pound/hash key</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #5c616c;">#</span><span style="color: #5c616c;">=</span>

<span style="color: #5c616c;">For multi-line comments,</span>
<span style="color: #5c616c;">use the '#= =#' sequence.</span>

<span style="color: #5c616c;">=#</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb44c28" class="outline-3">
<h3 id="syntax-for-basic-math"><a id="orgfb44c28"></a><span class="section-number-3">1.4</span> Syntax for basic math</h3>
<div class="outline-text-3" id="text-syntax-for-basic-math">
<div class="org-src-container">
<pre class="src src-julia">sum = 3 + 7
</pre>
</div>

<pre class="example">
10

</pre>

<div class="org-src-container">
<pre class="src src-julia">difference = 10 - 3
</pre>
</div>

<pre class="example">
7

</pre>

<div class="org-src-container">
<pre class="src src-julia">product = 20 * 5
</pre>
</div>

<pre class="example">
100

</pre>

<div class="org-src-container">
<pre class="src src-julia">quotient = 100 / 10
</pre>
</div>

<pre class="example">
10.0

</pre>

<div class="org-src-container">
<pre class="src src-julia">power = 10 ^ 2
</pre>
</div>

<pre class="example">
100

</pre>

<div class="org-src-container">
<pre class="src src-julia">modulus = 101 % 2
</pre>
</div>

<pre class="example">
1

</pre>
</div>
</div>

<div id="outline-container-org3bb612a" class="outline-3">
<h3 id="exercises"><a id="org3bb612a"></a><span class="section-number-3">1.5</span> Exercises</h3>
<div class="outline-text-3" id="text-exercises">
</div>

<div id="outline-container-orge1614f3" class="outline-4">
<h4 id="section"><a id="orge1614f3"></a><span class="section-number-4">1.5.1</span> Exercise 1</h4>
<div class="outline-text-4" id="text-section">
<p>
Look up <a href="https://docs.julialang.org/en/v1">docs</a> for the <code>convert</code> function.
</p>

<div class="org-src-container">
<pre class="src src-julia">a = 3
typeof(a)
a = convert(<span style="color: #EBBF83;">Float64</span>, a)
typeof(a)
</pre>
</div>

<pre class="example">
3
Int64
3.0
Float64

</pre>
</div>
</div>

<div id="outline-container-org5c70fd9" class="outline-4">
<h4 id="section-1"><a id="org5c70fd9"></a><span class="section-number-4">1.5.2</span> Exercise 2</h4>
<div class="outline-text-4" id="text-section-1">
<p>
Assign <code>365</code> to a variable named <code>days</code>. Convert <code>days</code> to a float.
</p>

<div class="org-src-container">
<pre class="src src-julia">days = 365
typeof(days)
days = convert(<span style="color: #EBBF83;">Float64</span>, days)
typeof(days)
</pre>
</div>

<pre class="example">
365
Int64
365.0
Float64

</pre>
</div>
</div>

<div id="outline-container-org1fc0943" class="outline-4">
<h4 id="section-2"><a id="org1fc0943"></a><span class="section-number-4">1.5.3</span> Exercise 3</h4>
<div class="outline-text-4" id="text-section-2">
<p>
See what happens when you execute
</p>

<div class="org-src-container">
<pre class="src src-julia">convert(<span style="color: #EBBF83;">Int64</span>, <span style="color: #718da5;">"1"</span>)
</pre>
</div>

<pre class="example">
ERROR: MethodError: Cannot `convert` an object of type String to an object of type Int64
Closest candidates are:
  convert(::Type{T&lt;:Number}, !Matched::T&lt;:Number) where T&lt;:Number at number.jl:6
  convert(::Type{T&lt;:Number}, !Matched::Number) where T&lt;:Number at number.jl:7
  convert(::Type{T&lt;:Integer}, !Matched::Ptr) where T&lt;:Integer at pointer.jl:23
  ...
Stacktrace:
 [1] top-level scope at none:0

</pre>

<p>
<b>An error rise because this try to cast a character to an <code>Int64</code></b>.
</p>

<p>
and
</p>

<div class="org-src-container">
<pre class="src src-julia">parse(<span style="color: #EBBF83;">Int64</span>, <span style="color: #718da5;">"1"</span>)
</pre>
</div>

<pre class="example">
1

</pre>

<p>
<b>This successfully cast the character to a <code>Int64</code></b>
</p>

<p>
<i>EOF</i>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 08/09/2018</p>
<p class="author">Author: Juliabox team</p>
<p class="date">Created: 2018-09-08 Sat 18:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
